app/controllers/home_controller.rb

SELECT `keywords`.id FROM `keywords` WHERE (`keywords`.`keyword_name` = BINARY 'wedding' AND `keywords`.id <> 57) LIMIT 1
SELECT * FROM `keywords` ORDER BY status, keyword_name
UPDATE `scrap_photos` SET selected_photo = TRUE WHERE (`scrap_photos`.`id` IN ('20','22','24'))
SELECT * FROM `scrap_photos` WHERE (`scrap_photos`.`selected_photo` = 1)
---
  def index
    if params[:keyword_id]
      Keyword.update(params[:keyword_id], :status => "Done")
    end
    @keywords = Keyword.find(:all, :order => "status, keyword_name")
    @keywords = @keywords.paginate(:per_page => 100, :page => params[:page])
    ScrapPhoto.update_all("selected_photo = TRUE", {:id => params[:selected_photos]}) if params[:selected_photos]
    @scrap_photos = ScrapPhoto.find(:all, :conditions => {:selected_photo => TRUE})

SELECT `keywords`.id FROM `keywords` WHERE (`keywords`.`keyword_name` = BINARY 'wedding' AND `keywords`.id <> 57) LIMIT 1
UPDATE `keywords` SET `updated_at` = '2010-08-23 16:08:22', `status` = 'Done' WHERE `id` = 57
INSERT INTO `scrap_xmls` (`created_at`, `updated_at`, `keyword_id`, `xml_file`, `status`) VALUES('2010-08-23 16:08:22', '2010-08-23 16:08:22', 57, NULL, NULL)
UPDATE `scrap_xmls` SET `updated_at` = '2010-08-23 16:08:22', `status` = 1 WHERE `id` = 5
---
  def photos
    @keyword = Keyword.find_or_create_by_keyword_name(params[:keyword_name])
    @keyword.update_attributes(:status => "Done")

    scrap_xml = ScrapXml.create(
      :keyword_id => @keyword.id,
      :xml_file => nil,
      :status => nil
    )

    flickr = Flickr.new(File.join(RAILS_ROOT, 'config', 'flickr.yml'))
    scrap_xml.update_attributes(:status => 1)

INSERT INTO `scrap_photos` (`url_large`, `original_id`, `url_small`, `created_at`, `latitude`, `place_id`, `woeid`, `title`, `author`, `farm`, `url_original`, `license`, `updated_at`, `accuracy`, `url_square`, `selected_photo`, `server`, `tags`, `is_family`, `keyword_id`, `scrap_xml_id`, `description`, `longitude`, `is_public`, `url_medium`, `status`, `secret`, `url_thumbnail`, `is_friend`) VALUES('http://farm4.static.flickr.com/3588/3468146088_615f88947d_b.jpg', 3468146088, 'http://farm4.static.flickr.com/3588/3468146088_615f88947d_m.jpg', '2010-08-23 16:08:45', NULL, NULL, NULL, 'Alessia e Dario, amigurumi wedding couple', '•°°• ♥♡ baghi ♡♥ •°°•', '4', 'http://farm4.static.flickr.com/3588/3468146088_8e0574368b_o.jpg', 6, '2010-08-23 16:08:45', NULL, 'http://farm4.static.flickr.com/3588/3468146088_615f88947d_s.jpg', NULL, '3588', 'bear wedding cute animal groom bride beige couple handmade crochet felt softie cotton kawaii amigurumi handcraft savona rainbowproject', '0', 57, 5, 'For two my best friend with love ^__^\n\nPattern on my shop, see my profile for info\n\n<a href=\"http://baghisblog.blogspot.com/\" rel=\"nofollow\">baghisblog.blogspot.com/</a>', NULL, '1', 'http://farm4.static.flickr.com/3588/3468146088_615f88947d.jpg', NULL, '615f88947d', 'http://farm4.static.flickr.com/3588/3468146088_615f88947d_t.jpg', '0')
---
        :is_friend      => photo.is_friend,
        :is_public      => photo.is_public
      )
      if scrap_photo.save